CSI API ETABS v1

# cSapModelEditFrame Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cEditFrame EditFrame { get; }

    ReadOnly Property EditFrame As cEditFrame
    	Get

    Dim instance As cSapModel
    Dim value As cEditFrame

    value = instance.EditFrame

    property cEditFrame^ EditFrame {
    	cEditFrame^ get ();
    }

    abstract EditFrame : cEditFrame with get

#### Property Value

Type: cEditFrame

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com